<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[Liberation Notes]]></title><description><![CDATA[This is me thinking about life and software, discovering old lessons and learning new stuff.]]></description><link>https://cmwang.net/</link><image><url>https://cmwang.net/favicon.png</url><title>Liberation Notes</title><link>https://cmwang.net/</link></image><generator>Ghost 5.78</generator><lastBuildDate>Wed, 07 Feb 2024 16:46:23 GMT</lastBuildDate><atom:link href="https://cmwang.net/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[ðŸ“š Design Patterns Explained - CH1]]></title><description><![CDATA[This note summarizes the first chapter of "Design Patterns Explained."]]></description><link>https://cmwang.net/2024/02/design-patterns-explained-ch1/</link><guid isPermaLink="false">65babe2f55ac333e5a0137b3</guid><category><![CDATA[Software Design]]></category><category><![CDATA[Notes]]></category><dc:creator><![CDATA[Jamie Wang]]></dc:creator><pubDate>Wed, 07 Feb 2024 16:00:00 GMT</pubDate><media:content url="https://cmwang.net/content/images/2024/01/81xYhfUxw8L._AC_UF1000-1000_QL80_.jpg" medium="image"/><content:encoded><![CDATA[<h1 id="object-oriented-paradigm">Object-Oriented Paradigm</h1><img src="https://cmwang.net/content/images/2024/01/81xYhfUxw8L._AC_UF1000-1000_QL80_.jpg" alt="&#x1F4DA; Design Patterns Explained - CH1"><p>Purpose: Explain why object-oriented paradigm over functional decomposition.</p><h2 id="naive-problem">Naive Problem</h2><p>If I were to give you the task of writing code to access a description of shapes that were stored in a database and then display them.</p><p>&#x5982;&#x679C;&#x7D66;&#x4F60;&#x4E00;&#x500B;&#x4EFB;&#x52D9;&#xFF0C;&#x8981;&#x7DE8;&#x5BEB;&#x4E00;&#x6BB5;&#x7A0B;&#x5F0F;&#xFF0C;&#x5B58;&#x53D6;&#x5728;&#x8CC7;&#x6599;&#x5EAB;&#x4E2D;&#x5132;&#x5B58;&#x7684;&#x5F62;&#x72C0;&#x63CF;&#x8FF0;&#xFF0C;&#x7136;&#x5F8C;&#x5C07;&#x5B83;&#x986F;&#x793A;&#x51FA;&#x4F86;&#x3002;</p><h2 id="structural-programming-thinkingpossible-steps">Structural Programming thinking - possible steps</h2><ol><li>Locate the list of shapes in the database. (&#x5728;&#x8CC7;&#x6599;&#x5EAB;&#x4E2D;&#x627E;&#x5230;&#x5F62;&#x72C0;&#x6E05;&#x55AE;)&#x3002;</li><li>Open up the list of shapes. (&#x6253;&#x958B;&#x5F62;&#x72C0;&#x6E05;&#x55AE;)&#x3002;</li><li>Sort the list according to some rules. (&#x4F9D;&#x7167;&#x67D0;&#x7A2E;&#x898F;&#x5247;&#x5C07;&#x6E05;&#x55AE;&#x6392;&#x5E8F;)&#x3002;</li><li>Display the individual shapes on the monitor. (&#x5728;&#x87A2;&#x5E55;&#x4E0A;&#x986F;&#x793A;&#x5404;&#x7A2E;&#x5F62;&#x72C0;)&#x3002;</li></ol><h2 id="functional-decomposition-%E5%8A%9F%E8%83%BD%E5%88%86%E8%A7%A3">Functional Decomposition (&#x529F;&#x80FD;&#x5206;&#x89E3;)</h2><p>4a. Identify the type of shape. (&#x8B58;&#x5225;&#x5F62;&#x72C0;&#x7684;&#x985E;&#x578B;)&#x3002; 4b. Get the location of the shape. (&#x7372;&#x53D6;&#x5F62;&#x72C0;&#x7684;&#x4F4D;&#x7F6E;)&#x3002;</p><p>4c. Call the appropriate function that will display the shape, giving it the shape&#x2019;s location. (&#x4EE5;&#x5F62;&#x72C0;&#x7684;&#x4F4D;&#x7F6E;&#x70BA;&#x53C3;&#x6578;&#xFF0C;&#x547C;&#x53EB;&#x986F;&#x793A;&#x5F62;&#x72C0;&#x7684; Function)&#x3002;</p><h2 id="functional-decomposition-%E7%9A%84%E6%8C%91%E6%88%B0">Functional Decomposition &#x7684;&#x6311;&#x6230;</h2><ol><li>&#x5B83;&#x901A;&#x5E38;&#x6703;&#x5C0E;&#x81F4;&#x4E00;&#x500B;<strong>&#x4E3B;&#x7A0B;&#x5F0F;&#x8CA0;&#x8CAC;&#x63A7;&#x5236;&#x5B50;&#x7A0B;&#x5F0F;(subprograms)&#x3002; &#x9019;&#x4F7F;&#x5F97;&#x4E3B;&#x7A0B;&#x5F0F;&#x6240;&#x627F;&#x53D7;&#x7684;&#x8CAC;&#x4EFB;</strong>&#x592A;&#x591A;&#x4E86;&#xFF1A;&#x8981;&#x5354;&#x8ABF;&#x5404; subprograms&#xFF0C;&#x9084;&#x8981;&#x63A7;&#x5236;&#x4ED6;&#x5011;&#x7684;&#x9806;&#x5E8F; (Why not delegation?)&#x3002;&#xA0;<strong>&#xAB;&#x4E0A;&#x5E1D;&#x7269;&#x4EF6;&#xFF1A;&#x80FD;&#x8005;&#x591A;&#x52DE;&#xBB;</strong></li><li>&#x5982;&#x679C;&#x5C07;&#x5BE6;&#x4F5C;&#x5404;&#x6B65;&#x9A5F;&#x7684;&#x6240;&#x6709;&#x908F;&#x8F2F;&#x90FD;&#x653E;&#x5728;&#x4E00;&#x500B;&#x5927; Function &#x6216;&#x5927; module &#x7684;&#x8A71;&#xFF0C;&#x5247;&#x9019;&#x4E9B;&#x6B65;&#x9A5F;&#x7684;&#x5BE6;&#x8CEA;&#x6027;&#x8B8A;&#x5316;&#xFF0C;&#x90FD;&#x5FC5;&#x9808;&#x5C0D;&#x9019;&#x500B; Function &#x6216; module &#x9032;&#x884C;&#x4FEE;&#x6539;&#x3002;&#xA0;<strong>&#xAB;&#x56E0;&#x61C9;&#x8B8A;&#x5316;&#x7684;&#x80FD;&#x529B;&#x5DEE;&#xBB;</strong></li></ol><h2 id="%E8%A8%8E%E8%AB%96">&#x8A0E;&#x8AD6;</h2><ol><li>&#x9700;&#x6C42;&#x7E3D;&#x662F;&#x5728;&#x6539;&#x8B8A;&#xA0;<strong>(&#x4E0D;&#x8B8A;&#x7684;&#x771F;&#x7406;)</strong>&#x3002;</li><li>&#x6211;&#x5011;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053;&#x6703;&#x767C;&#x751F;&#x4EC0;&#x9EBC;&#x8B8A;&#x5316;&#xFF0C;&#x4F46;&#x6211;&#x5011;&#x80FD;&#x5920;&#x731C;&#x5230;&#x54EA;&#x88E1;&#x6703;&#x8B8A;&#x5316;&#x3002;<strong>(OO &#x6700;&#x5927;&#x7684;&#x512A;&#x9EDE;&#x4E4B;&#x4E00;&#xFF0C;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x5C01;&#x88DD;&#x9019;&#x4E9B;&#x8B8A;&#x5316;&#x5340;&#x57DF;)&#x3002;</strong></li><li>&#x8207;&#x5176;&#x62B1;&#x6028;&#x9700;&#x8981;&#x7E3D;&#x662F;&#x6539;&#x8B8A;&#xFF0C;&#x4E0D;&#x5982;&#x6539;&#x8B8A;&#x958B;&#x767C;&#x6D41;&#x7A0B;&#xFF0C;&#x6709;&#x6548;&#x7684;&#x56E0;&#x61C9;&#x8B8A;&#x5316;&#x3002;</li></ol><h2 id="dealing-with-changes-functional-decomposition">Dealing with Changes: Functional Decomposition</h2><p>4c. Call the appropriate function that will display the shape, giving it the shape&#x2019;s location. (&#x4EE5;&#x5F62;&#x72C0;&#x7684;&#x4F4D;&#x7F6E;&#x70BA;&#x53C3;&#x6578;&#xFF0C;&#x547C;&#x53EB;&#x986F;&#x793A;&#x5F62;&#x72C0;&#x7684; Function)&#x3002;</p><p><strong>Using Modularity to Contain Variation</strong></p><pre><code class="language-c">function: display shape
input: type of shape, description of shape
action:
   switch (type of shape)
      case square: put display function for square here
      case circle: put display function for circle here
</code></pre><h2 id="%E8%A8%8E%E8%AB%96-1">&#x8A0E;&#x8AD6;</h2><ol><li>&#x5982;&#x679C;&#x8981;&#x986F;&#x793A;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x5F62;&#x72C0;(&#x4F8B;&#x5982;&#x4E09;&#x89D2;&#x5F62;)&#xFF0C;&#x6211;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x6539;&#x9019;&#x500B;&#x6A21;&#x7D44;(&#x5E0C;&#x671B;&#x662F;)&#x3002;</li><li>&#x9019;&#x500B;&#x6A21;&#x7D44;&#x7684;&#x8F38;&#x5165;&#x662F; type of shape, description of shape&#xFF0C;&#x5982;&#x679C;&#x4ECA;&#x5929;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;&#x8F38;&#x5165;(&#x4F8B;&#x5982; array of points &#x6216;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;)&#xFF0C;&#x8A72;&#x600E;&#x9EBC;&#x8FA6;&#xFF1F;</li></ol><hr><h2 id="functional-decomposition-%E5%85%A9%E5%80%8B%E5%8F%AF%E8%83%BD%E7%9A%84%E5%95%8F%E9%A1%8C">Functional Decomposition &#x5169;&#x500B;&#x53EF;&#x80FD;&#x7684;&#x554F;&#x984C;</h2><ol><li><strong>Weak cohesion</strong>&#xA0;(Cohesion refers to how &#x201C;closely the operations in a routine are related; cohesion as&#xA0;<strong>clarity</strong>&#xA0;because the more that operations are related in a routine (or a class), the easier it is to understand things.)</li><li><strong>Tight Coupling</strong>&#xA0;(Coupling refers to &#x201C;the strength of a connection between two routines. Coupling is a complement to cohesion.)</li></ol><p>The goal is to create routines with internal integrity&#xA0;<strong>(strong cohesion)</strong>&#xA0;and small, direct, visible, and flexible relations to other routines&#xA0;<strong>(loose coupling)</strong>.</p><hr><h2 id="%E5%BE%9E%E6%97%A5%E5%B8%B8%E7%94%9F%E6%B4%BB%E5%80%9F%E9%8F%A1">&#x5F9E;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x501F;&#x93E1;</h2><p>You are an instructor at a conference. People in your class have another class to attend following yours, but don&#x2019;t know where it is located. One of your responsibilities is to make sure everyone knows how to get to the next class.</p><p>&#x4F60;&#x7684;&#x8CAC;&#x4EFB;&#x662F;&#x78BA;&#x4FDD;&#x5927;&#x5BB6;&#x77E5;&#x9053;&#x600E;&#x9EBC;&#x53BB;&#x5230;&#x4E0B;&#x4E00;&#x5802;&#x8AB2;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p><hr><h2 id="%E5%8F%AF%E8%83%BD%E7%9A%84%E6%AD%A5%E9%A9%9F">&#x53EF;&#x80FD;&#x7684;&#x6B65;&#x9A5F;</h2><ol><li>Get list of people in the class.</li><li>For each person on this list, do the following:<ol><li>Find the next class he or she is taking.</li><li>Find the location of that class.</li><li>Find the way to get from your classroom to the person&#x2019;s next class.</li><li>Tell the person how to get to his or her next class.</li></ol></li></ol><hr><h2 id="%E6%89%80%E4%BB%A5%E4%BD%A0%E5%8F%AF%E8%83%BD%E9%9C%80%E8%A6%81%E9%80%99%E9%BA%BC%E5%81%9A">&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x9019;&#x9EBC;&#x505A;</h2><ol><li>A way of getting the list of people in the class.</li><li>A way of getting the schedule for each person in the class.</li><li>A program that gives someone directions from your classrom to any other classroom.</li><li>A control program that works for each person in the class and does the reuqired steps for each person.</li></ol><hr><h2 id="%E4%B8%8D-%E4%BD%A0%E6%87%89%E8%A9%B2%E6%9C%83%E9%80%99%E6%A8%A3%E5%81%9A">&#x4E0D;! &#x4F60;&#x61C9;&#x8A72;&#x6703;&#x9019;&#x6A23;&#x505A;</h2><p>&#x4F60;&#x53EF;&#x80FD;&#x6703;&#x628A;&#x5F9E;&#x9019;&#x500B;&#x6559;&#x5BA4;&#x5230;&#x5176;&#x4ED6;&#x6559;&#x5BA4;&#x7684;&#x8DEF;&#x7DDA;&#x8CBC;&#x51FA;&#x4F86;&#xFF0C;&#x7136;&#x5F8C;&#x544A;&#x8A34;&#x6240;&#x6709;&#x4EBA;&#xFF1A;&#x6211;&#x5011;&#x5DF2;&#x7D93;&#x5C07;&#x4E0B;&#x4E00;&#x5802;&#x8AB2;&#x7684;&#x5730;&#x9EDE;&#x548C;&#x5176;&#x4ED6;&#x6559;&#x5BA4;&#x7684;&#x4F4D;&#x7F6E;&#x90FD;&#x8CBC;&#x5728;&#x5F8C;&#x9762;&#x4E86;&#xFF0C;&#x8ACB;&#x6839;&#x64DA;&#x5B83;&#x627E;&#x5230;&#x4F60;&#x5011;&#x4E0B;&#x4E00;&#x5802;&#x8AB2;&#x7684;&#x6559;&#x5BA4;&#x3002;</p><p>You would probably post directions to go from this classroom to the other classrooms and then tell everyone in the class,&#xA0;<strong><em>I have posted the locations of the classes following this in the back of the room, as well as the locations of the other classrooms. Please use them to go to your next classroom.</em></strong></p><hr><h2 id="%E5%85%A9%E7%A8%AE%E7%AD%96%E7%95%A5%E7%9A%84%E5%B7%AE%E5%88%A5">&#x5169;&#x7A2E;&#x7B56;&#x7565;&#x7684;&#x5DEE;&#x5225;</h2><ol><li>Giving&#xA0;<strong>explicit directions</strong>&#xA0;to everyone.</li><li>Giving&#xA0;<strong>general instructions</strong>&#xA0;and then expect the each person will figure out how to do the task individually.&#xA0;<strong>(&#x8CAC;&#x4EFB;&#x8F49;&#x79FB; delegation)</strong></li></ol><hr><h2 id="%E9%9C%80%E6%B1%82%E5%8F%88%E6%94%B9%E8%AE%8A%E4%BA%86">&#x9700;&#x6C42;&#x53C8;&#x6539;&#x8B8A;&#x4E86;</h2><p>&#x5982;&#x679C;&#x6211;&#x88AB;&#x544A;&#x77E5;&#xFF0C;&#x9700;&#x8981;&#x7D66;&#x64D4;&#x4EFB;&#x52A9;&#x6559;&#x5DE5;&#x4F5C;&#x7684;&#x5B78;&#x751F;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x6307;&#x793A;&#x3002;&#x4ED6;&#x5011;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x4E0B;&#x4E00;&#x5802;&#x8AB2;&#x524D;&#x6536;&#x96C6;&#x672C;&#x5802;&#x8AB2;&#x5B78;&#x751F;&#x7684;&#x8A55;&#x50F9;&#xFF0C;&#x4E26;&#x4E14;&#x4EA4;&#x5230;&#x8FA6;&#x516C;&#x5BA4;&#x3002;</p><ol><li>&#x7B2C;&#x4E00;&#x7A2E;&#x65B9;&#x5F0F;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x6539;&#x63A7;&#x88FD;&#x7A0B;&#x5F0F;&#xFF0C;<strong>&#x5340;&#x5225;&#x7814;&#x7A76;&#x751F;&#x8DDF;&#x5927;&#x5B78;&#x751F;</strong>&#xFF0C;&#x7136;&#x5F8C;&#x7D66;&#x7814;&#x7A76;&#x751F;&#x7279;&#x5225;&#x7684;&#x6307;&#x793A;&#x3002;</li><li>&#x7B2C;&#x4E8C;&#x7A2E;&#x65B9;&#x5F0F;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x70BA;&#x7814;&#x7A76;&#x751F;&#x518D;&#x7DE8;&#x5BEB;&#x4E00;&#x500B;&#x7A0B;&#x5F0F;&#xFF0C;&#x4F46;&#x63A7;&#x88FD;&#x7A0B;&#x5F0F;&#x4ECD;&#x7136;&#x53EA;&#x9700;&#x8981;&#x8AAA;:&#xA0;<strong>&#x627E;&#x5230;&#x4F60;&#x5011;&#x7684;&#x4E0B;&#x4E00;&#x5802;&#x6559;&#x5BA4;</strong>&#x3002;</li></ol><hr><h2 id="%E7%82%BA%E4%BB%80%E9%BA%BC%E6%9C%89%E9%80%99%E9%BA%BC%E5%A4%A7%E7%9A%84%E5%B7%AE%E7%95%B0">&#x70BA;&#x4EC0;&#x9EBC;&#x6709;&#x9019;&#x9EBC;&#x5927;&#x7684;&#x5DEE;&#x7570;</h2><ol><li>&#x4EBA;&#x5011;&#x5C0D;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x70BA;&#x8CA0;&#x8CAC;&#xFF0C;&#x800C;&#x4E0D;&#x518D;&#x7531;&#x4E00;&#x500B;&#x4E2D;&#x592E;&#x63A7;&#x88FD;&#x7A0B;&#x5F0F;&#x8CA0;&#x8CAC;&#x6C7A;&#x5B9A;&#x3002;</li><li>&#x63A7;&#x88FD;&#x7A0B;&#x5F0F;&#x53EF;&#x4EE5;&#x8207;&#x4E0D;&#x540C;&#x985E;&#x578B;&#x7684;&#x5B78;&#x751F;&#x4EA4;&#x6D41;(&#x5927;&#x5B78;&#x751F;&#x6216;&#x7814;&#x7A76;&#x751F;)&#x3002;</li><li>&#x63A7;&#x88FD;&#x7A0B;&#x5F0F;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B78;&#x751F;&#x5F9E;&#x9019;&#x500B;&#x6559;&#x5BA4;&#x5230;&#x4E0B;&#x4E00;&#x500B;&#x6559;&#x5BA4;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x63A1;&#x53D6;&#x7684;&#x4EFB;&#x4F55;&#x7279;&#x6B8A;&#x6B65;&#x9A5F;&#x3002;</li></ol><hr><h2 id="%E8%BB%9F%E9%AB%94%E9%96%8B%E7%99%BC%E7%9A%84%E4%B8%89%E7%A8%AE%E8%A6%96%E8%A7%92">&#x8EDF;&#x9AD4;&#x958B;&#x767C;&#x7684;&#x4E09;&#x7A2E;&#x8996;&#x89D2;</h2><ol><li><strong>Conceptual:</strong>&#xA0;&#x8868;&#x793A; domain concepts&#xFF0C;&#x4E0D;&#x7BA1;&#x5982;&#x4F55;&#x5BE6;&#x4F5C;&#x3002;&#x56DE;&#x7B54;&#x9019;&#x500B;&#x554F;&#x984C;&#xFF1A;<strong>What am I responsibile for?</strong></li><li><strong>Specification:</strong>&#xA0;&#x95DC;&#x6CE8;&#x8EDF;&#x9AD4;&#x7684; interface&#xFF0C;&#x4F46;&#x9084;&#x662F;&#x4E0D;&#x7BA1;&#x5982;&#x4F55;&#x5BE6;&#x4F5C;&#x3002;&#x56DE;&#x7B54;&#x9019;&#x500B;&#x554F;&#x984C;&#xFF1A;<strong>How am I used?</strong></li><li><strong>Implementation:</strong>&#xA0;&#x6211;&#x5011;&#x90FD;&#x5F88;&#x719F;&#x3002;&#x56DE;&#x7B54;&#x9019;&#x500B;&#x554F;&#x984C;&#xFF1A;&#xA0;<strong>How do I fulfill my responsibilities?&quot;</strong></li></ol><hr><h2 id="%E4%B8%8D%E5%90%8C%E8%A6%96%E8%A7%92%E7%9A%84%E7%94%A8%E9%80%94">&#x4E0D;&#x540C;&#x8996;&#x89D2;&#x7684;&#x7528;&#x9014;</h2><p>&#x6982;&#x5FF5;&#x5C64;&#x6B21;&#x4E0A;&#x7684;&#x6E9D;&#x901A;&#xFF1A;&#x4F60;&#x544A;&#x8A34;&#x5B78;&#x751F;&#x7684;&#x662F;&#x300C;&#x4F60;&#x8981;&#x4ED6;&#x5011;&#x600E;&#x9EBC;&#x505A;&#x300D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x300C;&#x5982;&#x4F55;&#x53BB;&#x505A;&#x300D;&#x3002; (you are telling people what you want, not how to do it.)</p><p>&#x5728;&#x6982;&#x5FF5;&#x5C64;&#x6B21;&#x4E0A;&#x4EA4;&#x6D41;&#xFF0C;&#x800C;&#x5728;&#x53E6;&#x4E00;&#x5C64;&#x6B21;(&#x5BE6;&#x4F5C;)&#x4E0A;&#x57F7;&#x884C;&#xFF0C;&#x9019;&#x6A23;&#x8B1B;&#x5E2B;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5177;&#x9AD4;&#x7684;&#x5BE6;&#x4F5C;&#x7D30;&#x7BC0;&#x3002;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x822C;&#x6027;&#xFF0C;&#x6982;&#x5FF5;&#x6027;&#x7684;&#x77E5;&#x9053;&#x5373;&#x53EF;&#x3002;</p><p><strong>&#x6548;&#x529B;</strong>&#xFF1A;&#x53EA;&#x8981;&#x6982;&#x5FF5;&#x4E0D;&#x8B8A;&#xFF0C;&#x8ACB;&#x6C42;&#x8005;&#x8207;<strong>&#x5BE6;&#x4F5C;&#x7D30;&#x7BC0;&#x7684;&#x8B8A;&#x5316;</strong>&#x5C31;&#x88AB;&#x9694;&#x96E2;&#x958B;&#x4F86;&#x3002;</p><hr><h2 id="object-oriented-paradigm-1">Object-Oriented Paradigm</h2><p>&#x4F7F;&#x7528;&#x7269;&#x4EF6;&#x7684;&#x512A;&#x9EDE;&#x5728;&#x65BC;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x7FA9;&#x7269;&#x4EF6;&#x8CA0;&#x8CAC;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#x52D9;&#x3002;</p><figure class="kg-card kg-image-card"><img src="https://cmwang.net/content/images/2024/01/resp.png" class="kg-image" alt="&#x1F4DA; Design Patterns Explained - CH1" loading="lazy" width="2000" height="1316" srcset="https://cmwang.net/content/images/size/w600/2024/01/resp.png 600w, https://cmwang.net/content/images/size/w1000/2024/01/resp.png 1000w, https://cmwang.net/content/images/size/w1600/2024/01/resp.png 1600w, https://cmwang.net/content/images/2024/01/resp.png 2000w" sizes="(min-width: 720px) 720px"></figure><hr><h2 id="%E8%A8%8E%E8%AB%96-2">&#x8A0E;&#x8AD6;</h2><p>The&#xA0;<strong>objects</strong>&#xA0;were identified by looking at the entities in the&#xA0;<strong>problem domain</strong>. I identified the&#xA0;<strong>responsibilities (or methods)</strong>&#xA0;for each object by looking at what these entities&#xA0;<strong>need to do</strong>.</p><p>&#x2013; &#x2606;&#x2606;&#x2606; &#x7406;&#x89E3;&#x7269;&#x4EF6;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F; &#x2606;&#x2606;&#x2606;&#xA0;<strong>&#x5C07;&#x5176;&#x770B;&#x70BA;&#x5177;&#x6709;&#x8CAC;&#x4EFB;&#x7684;&#x6771;&#x897F;</strong>&#x3002;&#x7269;&#x4EF6;&#x61C9;&#x8A72;&#x81EA;&#x5DF1;&#x8CA0;&#x8CAC;&#x81EA;&#x5DF1;&#xFF0C;&#x800C;&#x4E14;&#x61C9;&#x8A72;&#x6E05;&#x695A;&#x5730;&#x5B9A;&#x7FA9;&#x8CAC;&#x4EFB;&#x3002;</p><hr><h2 id="apply-fowler%E2%80%99s-perspectives">Apply Fowler&#x2019;s Perspectives</h2><ul><li>At the&#xA0;<strong>conceptual</strong>&#xA0;level, an object is a set of responsibilities. (&#x4E00;&#x7D44;&#x8CAC;&#x4EFB;)</li><li>At the&#xA0;<strong>specification</strong>&#xA0;level, an object is a set of methods (behaviors) that can be invoked by other objects or by itself. (&#x4E00;&#x7D44;&#x884C;&#x70BA;)</li><li>At the&#xA0;<strong>implementation</strong>&#xA0;level, an object is code and data and computational interactions between them.</li></ul><hr><h2 id="object-oriented-approach">Object-Oriented Approach</h2><ol><li>Start the control program.</li><li>Instantiate the collection of students in the classroom.</li><li>Tell the collection to have the students go to their next class.</li><li>The collection tells each student to go to his or her next class.</li><li>Each student:<ol><li>Finds where his next class is.</li><li>Determines how to get there.</li><li>Goes there.</li></ol></li><li>Done.</li></ol><hr><h2 id="abstract-and-polymorphism">Abstract and Polymorphism</h2><ul><li>Student abstract class, GraduageStudent and RegularStudent classes.</li><li>Abstract classes define what other, related, classes can do. Abstract classes act as&#xA0;<strong>placeholders</strong>&#xA0;for other classes.</li><li>Collection &#x53EA;&#x9700;&#x8981;&#x8655;&#x7406; Student &#x9019;&#x500B; Concept (Abstract)&#xFF0C;&#x6BCF;&#x4E00;&#x7A2E; Student &#x90FD;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x5BE6;&#x4F5C;&#x529F;&#x80FD; (Concrete)&#x3002;</li><li>&#x7576;&#x6211;&#x5011;&#x900F;&#x904E;&#x62BD;&#x8C61;&#x53C3;&#x8003;&#xFF0C;&#x6982;&#x5FF5;&#x6027;&#x7684;&#x8981;&#x6C42;&#x7269;&#x4EF6;&#x505A;&#x4EC0;&#x9EBC;&#x6642;&#xFF0C;&#x5C07;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x884C;&#x70BA;&#xFF0C;&#x5177;&#x9AD4;&#x884C;&#x70BA;&#x53D6;&#x6C7A;&#x65BC; Derived Class &#x7684;&#x5BE6;&#x4F5C;&#x3002;<strong>(Polymorphism)</strong></li></ul><hr><h2 id="%E5%9B%9E%E5%88%B0%E4%B8%80%E9%96%8B%E5%A7%8B%E7%9A%84%E5%95%8F%E9%A1%8C">&#x56DE;&#x5230;&#x4E00;&#x958B;&#x59CB;&#x7684;&#x554F;&#x984C;</h2><ol><li>Locate the list of shapes in the database. (&#x5728;&#x8CC7;&#x6599;&#x5EAB;&#x4E2D;&#x627E;&#x5230;&#x5F62;&#x72C0;&#x6E05;&#x55AE;)&#x3002;</li><li>Open up the list of shapes. (&#x6253;&#x958B;&#x5F62;&#x72C0;&#x6E05;&#x55AE;)&#x3002;</li><li>Sort the list according to some rules. (&#x4F9D;&#x7167;&#x67D0;&#x7A2E;&#x898F;&#x5247;&#x5C07;&#x6E05;&#x55AE;&#x6392;&#x5E8F;)&#x3002;</li><li>Display the individual shapes on the monitor. (&#x5728;&#x87A2;&#x5E55;&#x4E0A;&#x986F;&#x793A;&#x5404;&#x7A2E;&#x5F62;&#x72C0;)&#x3002;</li></ol><hr><h2 id="object-oriented-approach-12">Object-Oriented Approach (1/2)</h2><figure class="kg-card kg-image-card"><img src="https://cmwang.net/content/images/2024/01/resp2.png" class="kg-image" alt="&#x1F4DA; Design Patterns Explained - CH1" loading="lazy" width="837" height="724" srcset="https://cmwang.net/content/images/size/w600/2024/01/resp2.png 600w, https://cmwang.net/content/images/2024/01/resp2.png 837w" sizes="(min-width: 720px) 720px"></figure><hr><h2 id="object-oriented-approach-22">Object-Oriented Approach (2/2)</h2><ol><li>&#x4E3B;&#x7A0B;&#x5F0F;&#x5EFA;&#x7ACB;&#x4E00;&#x500B;&#xA0;<em>ShapeDataBase</em>&#xA0;&#x7269;&#x4EF6;&#x3002;</li><li>&#x4E3B;&#x7A0B;&#x5F0F;&#x8981;&#x6C42; database object &#x627E;&#x5230;&#x6211;&#x611F;&#x8208;&#x8DA3;&#x7684;&#x4E00;&#x7D44;&#x5F62;&#x72C0;&#xFF0C;&#x4E26;&#x4E14; instantiate &#x4E00;&#x500B;&#x4FDD;&#x5B58;&#x9019;&#x4E9B;&#x5F62;&#x72C0;&#x7684; collection &#x7269;&#x4EF6;.</li><li>&#x4E3B;&#x7A0B;&#x5F0F;&#x8981;&#x6C42; Collection &#x7269;&#x4EF6;&#x6392;&#x5E8F;&#x6240;&#x5B58;&#x653E;&#x7684;&#x5F62;&#x72C0;&#x3002;</li><li>&#x4E3B;&#x7A0B;&#x5F0F;&#x8981;&#x6C42; Collection &#x7269;&#x4EF6;&#x986F;&#x793A;&#x5F62;&#x72C0;&#x3002;</li><li>Collection &#x7269;&#x4EF6;&#x8981;&#x6C42;&#x6240;&#x5B58;&#x653E;&#x7684;&#x6BCF;&#x500B;&#x5F62;&#x72C0;&#x986F;&#x793A;&#x81EA;&#x5DF1;&#x3002;</li><li>&#x6BCF;&#x500B;&#x5F62;&#x72C0;&#x6839;&#x64DA;&#x5F62;&#x72C0;&#x7A2E;&#x985E;&#x986F;&#x793A;&#x81EA;&#x5DF1;&#x3002;</li></ol><hr><h2 id="%E9%9C%80%E6%B1%82%E5%8F%88%E6%94%B9%E8%AE%8A%E4%BA%86-1">&#x9700;&#x6C42;&#x53C8;&#x6539;&#x8B8A;&#x4E86;</h2><ul><li>&#x589E;&#x52A0;&#x65B0;&#x7684;&#x5F62;&#x72C0; (&#x4E09;&#x89D2;&#x5F62;)<ol><li>&#x589E;&#x52A0;&#x4E00;&#x500B;&#x65B0;&#x7684;&#x4E09;&#x89D2;&#x5F62; Concrete Class</li><li>&#x5728;&#x6B64; Derived Class &#x5BE6;&#x4F5C;&#x81EA;&#x5DF1;&#x7684;&#x986F;&#x793A;&#x65B9;&#x6CD5;&#x3002;</li></ol></li><li>&#x66F4;&#x6539;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;<ol><li>&#x4FEE;&#x6539; Collection &#x7684; Sorting algorithm</li></ol></li></ul><p><strong>&#x7D50;&#x679C;</strong>&#xFF1A;The object-oriented approach has limited the impact of&#xA0;<strong>changing</strong>&#xA0;requirements.</p><hr><h2 id="%E5%B0%81%E8%A3%9D%E7%9A%84%E5%84%AA%E9%BB%9E">&#x5C01;&#x88DD;&#x7684;&#x512A;&#x9EDE;</h2><ol><li>&#x4F7F;&#x7528;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x70BA;&#x4F7F;&#x7528;&#x8005;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x64D4;&#x5FC3;&#x5BE6;&#x4F5C;&#x554F;&#x984C;</li><li>&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x8003;&#x616E;&#x547C;&#x53EB;&#x8005;&#x7684;&#x60C5;&#x6CC1;&#x4E0B;&#x4FEE;&#x6539;&#x5BE6;&#x4F5C; (&#x56E0;&#x70BA;&#x5B83;&#x4E00;&#x958B;&#x59CB;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x7269;&#x4EF6;&#x600E;&#x9EBC;&#x5BE6;&#x4F5C;&#x7684; depend on interface, not implementation)</li><li>The internals of an object are unknown to other objects. (&#x5C01;&#x88DD;&#x4F7F;&#x7269;&#x4EF6;&#x5167;&#x90E8;&#x884C;&#x70BA;&#x7684;&#x8B8A;&#x5316;&#x5C0D;&#x5176;&#x4ED6;&#x7269;&#x4EF6;&#x8B8A;&#x5F97;&#x900F;&#x660E;&#x4E86;&#xA0;<strong>&lt;&#x4E0D;&#x53EF;&#x898B;&gt;</strong>)&#x3002;</li></ol><hr><h2 id="take-away">Take away</h2><ol><li>&#x5C07;&#x7269;&#x4EF6;&#x770B;&#x70BA;<strong>&#x5177;&#x6709;&#x8CAC;&#x4EFB;</strong>&#x7684;&#x6771;&#x897F;&#x3002;&#x7269;&#x4EF6;&#x61C9;&#x8A72;&#x81EA;&#x5DF1;&#x8CA0;&#x8CAC;&#x81EA;&#x5DF1;&#xFF0C;&#x800C;&#x4E14;&#x61C9;&#x8A72;&#x6E05;&#x695A;&#x5730;&#x5B9A;&#x7FA9;&#x8CAC;&#x4EFB;&#x3002;</li><li>&#x7269;&#x4EF6;&#x771F;&#x6B63;&#x7684;&#x5A01;&#x529B;&#x4E0D;&#x5728;&#x65BC;&#x7E7C;&#x627F;&#xFF0C;&#x800C;&#x662F;&#x4F86;&#x81EA;&#x65BC;<strong>&#x5C01;&#x88DD;&#x884C;&#x70BA;</strong>(&#x63A1;&#x53D6;&#x66F4;&#x5EE3;&#x7FA9;&#x7684;&#x5C01;&#x88DD;&#x5B9A;&#x7FA9;)&#x3002;</li><li>OO &#x6700;&#x5927;&#x7684;&#x512A;&#x9EDE;&#x4E4B;&#x4E00;&#xFF0C;&#x5C31;&#x662F;&#x53EF;&#x4EE5;<strong>&#x5C01;&#x88DD;</strong>&#x9019;&#x4E9B;<strong>&#x8B8A;&#x5316;&#x5340;&#x57DF;</strong>&#x3002;</li><li>&#x62BD;&#x8C61;&#x8207;&#x8CAC;&#x4EFB;&#x8F49;&#x5AC1;&#x7684;&#x597D;&#x8655; (placeholder and delegation)&#x3002;</li><li>&#x4E09;&#x7A2E;&#x8996;&#x89D2;&#x7684;&#x61C9;&#x7528; (&#x5728;&#x62BD;&#x8C61;&#x5C64;&#x6B21;&#x4E0A;&#x6E9D;&#x901A;&#xFF0C;&#x5728;&#x5BE6;&#x4F5C;&#x5C64;&#x6B21;&#x4E0A;&#x57F7;&#x884C;)&#x3002;</li></ol>]]></content:encoded></item><item><title><![CDATA[âš ï¸ ANN 101]]></title><description><![CDATA[Knowledge Sharing]]></description><link>https://cmwang.net/portfolio/ann-101/</link><guid isPermaLink="false">65c3a172b16fd30ca31a0ad7</guid><category><![CDATA[Knowledge Sharing]]></category><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 15:29:10 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1540575467063-178a50c2df87?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDQ0fHxwcmVzZW50YXRpb258ZW58MHx8fHwxNzA3Mjk5MzE1fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1540575467063-178a50c2df87?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDQ0fHxwcmVzZW50YXRpb258ZW58MHx8fHwxNzA3Mjk5MzE1fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="&#x26A0;&#xFE0F; ANN 101"><p>..</p><div class="kg-card kg-callout-card kg-callout-card-grey"><div class="kg-callout-text"><b><strong style="white-space: pre-wrap;">Role</strong></b>: CTO</div></div>
<!--kg-card-begin: html-->
<iframe src="https://www.slideshare.net/slideshow/embed_code/key/k9tfwkVB6rAIHW?startSlide=1" width="597" height="486" frameborder="0" marginwidth="0" marginheight="0" scrolling="no" style="border:1px solid #CCC; border-width:1px; margin-bottom:5px;max-width: 100%;" allowfullscreen></iframe>
<!--kg-card-end: html-->
]]></content:encoded></item><item><title><![CDATA[âš ï¸NLP 101]]></title><description><![CDATA[Knowledge Sharing]]></description><link>https://cmwang.net/portfolio/nlp-101/</link><guid isPermaLink="false">65c3a16fb16fd30ca31a0acb</guid><category><![CDATA[Knowledge Sharing]]></category><category><![CDATA[Portfolio]]></category><category><![CDATA[AI]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 15:28:33 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1540575467063-178a50c2df87?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDQ0fHxwcmVzZW50YXRpb258ZW58MHx8fHwxNzA3Mjk5MzE1fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1540575467063-178a50c2df87?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8c2VhcmNofDQ0fHxwcmVzZW50YXRpb258ZW58MHx8fHwxNzA3Mjk5MzE1fDA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="&#x26A0;&#xFE0F;NLP 101"><p>..</p><div class="kg-card kg-callout-card kg-callout-card-grey"><div class="kg-callout-text"><b><strong style="white-space: pre-wrap;">Role</strong></b>: CTO</div></div>
<!--kg-card-begin: html-->
<iframe src="https://www.slideshare.net/slideshow/embed_code/key/k9tfwkVB6rAIHW?startSlide=1" width="597" height="486" frameborder="0" marginwidth="0" marginheight="0" scrolling="no" style="border:1px solid #CCC; border-width:1px; margin-bottom:5px;max-width: 100%;" allowfullscreen></iframe>
<!--kg-card-end: html-->
]]></content:encoded></item><item><title><![CDATA[â—ï¸Wiki Notion]]></title><link>https://cmwang.net/portfolio/wiki-notion/</link><guid isPermaLink="false">65c343e8b16fd30ca31a09e6</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:48:58 GMT</pubDate><content:encoded/></item><item><title><![CDATA[â—ï¸Smart Home]]></title><description><![CDATA[<p>Wifi APP</p><p>Android</p>]]></description><link>https://cmwang.net/portfolio/office-face-recognition-copy/</link><guid isPermaLink="false">65c3431db16fd30ca31a09d0</guid><category><![CDATA[IoT]]></category><category><![CDATA[Portfolio]]></category><category><![CDATA[AI]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:45:43 GMT</pubDate><content:encoded><![CDATA[<p>Wifi APP</p><p>Android</p>]]></content:encoded></item><item><title><![CDATA[â—ï¸Office Face Recognition]]></title><description><![CDATA[<p>Wifi APP</p><p>Android</p>]]></description><link>https://cmwang.net/portfolio/office-face-recognition/</link><guid isPermaLink="false">65c34290b16fd30ca31a09be</guid><category><![CDATA[IoT]]></category><category><![CDATA[Portfolio]]></category><category><![CDATA[AI]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:43:39 GMT</pubDate><content:encoded><![CDATA[<p>Wifi APP</p><p>Android</p>]]></content:encoded></item><item><title><![CDATA[â—ï¸Cloud Management Server]]></title><link>https://cmwang.net/portfolio/cloud-management-server/</link><guid isPermaLink="false">65c34253b16fd30ca31a09b3</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:42:10 GMT</pubDate><content:encoded/></item><item><title><![CDATA[â—ï¸Deep Detector]]></title><link>https://cmwang.net/portfolio/deep-detector/</link><guid isPermaLink="false">65c341cbb16fd30ca31a09a6</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:39:56 GMT</pubDate><content:encoded/></item><item><title><![CDATA[â—ï¸gen10/11]]></title><description><![CDATA[<p></p><p>win register cloud</p>]]></description><link>https://cmwang.net/portfolio/inwin-gen10/</link><guid isPermaLink="false">65c33c6f7499711cefc1d478</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:20:02 GMT</pubDate><content:encoded><![CDATA[<p></p><p>win register cloud</p>]]></content:encoded></item><item><title><![CDATA[â—ï¸eShop]]></title><link>https://cmwang.net/portfolio/nilvana-estore/</link><guid isPermaLink="false">65c33c6d7499711cefc1d470</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:19:29 GMT</pubDate><content:encoded/></item><item><title><![CDATA[â—ï¸Nilvana Hardware]]></title><link>https://cmwang.net/portfolio/nilvana-hardware/</link><guid isPermaLink="false">65c33ccc7499711cefc1d489</guid><category><![CDATA[Hardware]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:18:24 GMT</pubDate><content:encoded/></item><item><title><![CDATA[â—ï¸Membership Website]]></title><link>https://cmwang.net/portfolio/nilvana-membership-website/</link><guid isPermaLink="false">65c33c6b7499711cefc1d468</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:17:49 GMT</pubDate><content:encoded/></item><item><title><![CDATA[â—ï¸Youtube Channel]]></title><link>https://cmwang.net/portfolio/youtube-channel/</link><guid isPermaLink="false">65c33c697499711cefc1d460</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:17:26 GMT</pubDate><media:content url="https://cmwang.net/content/images/2024/02/www.youtube.com_@nilvana-ai.png" medium="image"/><content:encoded/></item><item><title><![CDATA[â—ï¸Medium Post]]></title><description><![CDATA[<p>...</p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/-sPxNKfXasU?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="Object Detection from the Video Taken by Drone | Nilvana"></iframe></figure>]]></description><link>https://cmwang.net/portfolio/nilvana-medium-post/</link><guid isPermaLink="false">65c33c667499711cefc1d458</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:17:09 GMT</pubDate><content:encoded><![CDATA[<p>...</p><figure class="kg-card kg-embed-card"><iframe width="200" height="113" src="https://www.youtube.com/embed/-sPxNKfXasU?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" allowfullscreen title="Object Detection from the Video Taken by Drone | Nilvana"></iframe></figure>]]></content:encoded></item><item><title><![CDATA[â—ï¸Industrial Camera App]]></title><link>https://cmwang.net/portfolio/industrial-camera-app/</link><guid isPermaLink="false">65c339547499711cefc1d436</guid><category><![CDATA[AI]]></category><category><![CDATA[Portfolio]]></category><dc:creator><![CDATA[Nirvana AI]]></dc:creator><pubDate>Wed, 07 Feb 2024 08:16:24 GMT</pubDate><content:encoded/></item></channel></rss>